GodSpeeD-17/STM32F103C8T6_BareMetal/BareMetal/Driver/Timer/Src/timer.c
/**
 * @file	timer.c
 * @author	Shrey Shah
 * @brief	Timer Driver Implementation
 * @version	v1.0
 * @date	20-06-2026
 *
 * @details
 * @section TIM_DRIVER_IMPL_SCOPE Scope
 * This source file implements the public Timer driver API declared in
 * `timer.h`. The driver layer owns public validation, Timer clock-state
 * orchestration, register-image reads, codec staging/extraction orchestration,
 * register-specific dirty-write decisions, and public @ref driver_status_t handling.
 *
 * @section TIM_DRIVER_IMPL_FIELD_OWNERSHIP Field Ownership
 * The root configuration surface owns every base-configuration domain represented by @ref tim_config_t:
 * - `TIMx_CR1` counter behavior fields represented by @ref tim_config_counter_t
 * - `TIMx_PSC` prescaler
 * - `TIMx_ARR` auto-reload value
 * - `TIMx_CNT` counter value
 *
 * Timer PWM channel behavior is implemented by the cohesive sibling
 * `timer_pwm.c` source unit. DMA and master/slave behavior remain deferred.
 * This source also owns Timer DIER interrupt-request sources, SR event observation/acknowledgement,
 * and the fixed @ref TIM_ConfigForBlockingDelay service bootstrap plus bounded
 * blocking @ref TIM_BlockingDelayUs / @ref TIM_BlockingDelayMs helpers. Generic
 * Clock-gate mutation and NVIC delivery remain under RCC/application and
 * NVIC/application ownership respectively. Timer configuration APIs require
 * the application to enable the matching APB1 clock gate before entry.
 *
 * @section TIM_DRIVER_IMPL_LAYOUT Source Layout
 * The public implementation follows the same banner and sub-banner order as
 * `timer.h`: clock state, operation state, root configuration, grouped
 * configuration, timebase fields, counter fields, IRQ sources/events, and
 * blocking delay helpers at the end. Local helpers are kept ahead of the public
 * functions read as orchestration over validation, codec staging, and the
 * shared `RegOps_WriteIfChanged()` dirty-write primitive.
 */

// ==================================================================================================== //
//												Includes												//
// ==================================================================================================== //
#include "timer.h"
#include "timer_codec.h"
#include "timer_ll.h"
#include "rcc.h"
#include "stm32f1xx_rcc.h"

// ==================================================================================================== //
//										Local Driver Configuration										//
// ==================================================================================================== //

/** @brief Microsecond delay chunk used by the millisecond blocking helper @def TIM_DRIVER_BLOCKING_DELAY_MS_CHUNK_US */
#define TIM_DRIVER_BLOCKING_DELAY_MS_CHUNK_US			((uint16_t) 1000U)
/** @brief Conservative polling-loop budget per requested microsecond @def TIM_DRIVER_BLOCKING_DELAY_POLL_BUDGET_PER_US */
#define TIM_DRIVER_BLOCKING_DELAY_POLL_BUDGET_PER_US		((uint32_t) 1024UL)
/** @brief Fixed setup allowance added to the blocking polling-loop budget @def TIM_DRIVER_BLOCKING_DELAY_POLL_BUDGET_BASE */
#define TIM_DRIVER_BLOCKING_DELAY_POLL_BUDGET_BASE		((uint32_t) 1024UL)

// ==================================================================================================== //
//									Timer Clock Bus Mapping										//
// ==================================================================================================== //

/**
 * @brief Resolves the RCC clock bus associated with one Timer instance
 * @param[in] TIMx Timer peripheral instance
 * @param[out] pRCCBus Destination for the decoded RCC clock bus
 * @returns @ref driver_status_t "Clock-bus lookup status"
 * @retval - @ref `DRIVER_STATUS_SUCCESS`: Timer clock bus was resolved
 * @retval - @ref `DRIVER_STATUS_ERROR_NULL_PTR`: An input pointer was `NULL`
 * @retval - @ref `DRIVER_STATUS_ERROR_INVALID_ARG`: @p TIMx was unsupported
 */
__STATIC_FORCEINLINE driver_status_t _TIM_DecodeRCCBus(const TIM_TypeDef* const TIMx, rcc_bus_t* const pRCCBus)
{
	//! Validate both pointers before resolving or publishing the bus selector.
	if ((TIMx == NULL) || (pRCCBus == NULL))
	{
		return DRIVER_STATUS_ERROR_NULL_PTR;
	}

	//! Decode static STM32F1 clock topology directly without an index conversion or runtime LUT access.
	switch ((uintptr_t) TIMx)
	{
		case TIM2_BASE_ADDRESS:
		case TIM3_BASE_ADDRESS:
		case TIM4_BASE_ADDRESS:
		{
			*pRCCBus = RCC_APB1_BUS;
			break;
		}
		default:
		{
			return DRIVER_STATUS_ERROR_INVALID_ARG;
		}
	}

	return DRIVER_STATUS_SUCCESS;
}

// ==================================================================================================== //
//										Local Validation Helpers										//
// ==================================================================================================== //

/**
 * @brief Validates a Timer peripheral instance pointer
 * @param[in] TIMx Timer peripheral instance
 * Accepted values:
 * - `TIM2`
 * - `TIM3`
 * - `TIM4`
 * @returns @ref driver_status_t "Timer-instance validation status"
 * @retval - @ref `DRIVER_STATUS_SUCCESS`: @p TIMx is supported
 * @retval - @ref `DRIVER_STATUS_ERROR_NULL_PTR`: @p TIMx is `NULL`
 * @retval - @ref `DRIVER_STATUS_ERROR_INVALID_ARG`: @p TIMx is unsupported
 */
__STATIC_FORCEINLINE driver_status_t _TIM_ValidateInstance(const TIM_TypeDef* const TIMx)
{
	//! Reject a null pointer before evaluating the supported-instance policy.
	if (TIMx == NULL)
	{
		return DRIVER_STATUS_ERROR_NULL_PTR;
	}

	//! Keep general instance validation independent from clock-topology metadata.
	if (TIM_INSTANCE_IS_VALID(TIMx) != 0x00U)
	{
		return DRIVER_STATUS_SUCCESS;
	}
	else
	{
		return DRIVER_STATUS_ERROR_INVALID_ARG;
	}
}

/**
 * @brief Validates a Timer direction selector
 * @param[in] direction Timer direction selector
 * @returns @ref driver_status_t "Direction validation status"
 * @retval - @ref `DRIVER_STATUS_SUCCESS`: @p direction is valid
 * @retval - @ref `DRIVER_STATUS_ERROR_INVALID_ARG`: @p direction is invalid
 */
__STATIC_FORCEINLINE driver_status_t _TIM_ValidateDirection(const tim_direction_t direction)
{
	//! Keep selector policy in the public defines layer instead of duplicating raw values here.
	if (TIM_DIRECTION_IS_VALID(direction) != 0x00U)
	{
		return DRIVER_STATUS_SUCCESS;
	}
	else
	{
		return DRIVER_STATUS_ERROR_INVALID_ARG;
	}
}

/**
 * @brief Validates a Timer alignment selector
 * @param[in] alignment Timer edge/center-aligned selector
 * @returns @ref driver_status_t "Alignment validation status"
 * @retval - @ref `DRIVER_STATUS_SUCCESS`: @p alignment is valid
 * @retval - @ref `DRIVER_STATUS_ERROR_INVALID_ARG`: @p alignment is invalid
 */
__STATIC_FORCEINLINE driver_status_t _TIM_ValidateAlignment(const tim_count_mode_t alignment)
{
	//! Accept only the edge/center-aligned modes exposed by the public driver vocabulary.
	if (TIM_COUNT_MODE_IS_VALID(alignment) != 0x00U)
	{
		return DRIVER_STATUS_SUCCESS;
	}
	else
	{
		return DRIVER_STATUS_ERROR_INVALID_ARG;
	}
}

/**
 * @brief Validates a Timer one-pulse selector
 * @param[in] onePulse Timer one-pulse selector
 * @returns @ref driver_status_t "One-pulse validation status"
 * @retval - @ref `DRIVER_STATUS_SUCCESS`: @p onePulse is valid
 * @retval - @ref `DRIVER_STATUS_ERROR_INVALID_ARG`: @p onePulse is invalid
 */
__STATIC_FORCEINLINE driver_status_t _TIM_ValidateOnePulse(const tim_opm_t onePulse)
{
	//! Restrict OPM input to the two public binary selectors.
	if (TIM_OPM_IS_VALID(onePulse) != 0x00U)
	{
		return DRIVER_STATUS_SUCCESS;
	}
	else
	{
		return DRIVER_STATUS_ERROR_INVALID_ARG;
	}
}

/**
 * @brief Validates a Timer auto-reload preload selector
 * @param[in] autoReloadPreload Timer auto-reload preload selector
 * @returns @ref driver_status_t "Auto-reload preload validation status"
 * @retval - @ref `DRIVER_STATUS_SUCCESS`: @p autoReloadPreload is valid
 * @retval - @ref `DRIVER_STATUS_ERROR_INVALID_ARG`: @p autoReloadPreload is invalid
 */
__STATIC_FORCEINLINE driver_status_t _TIM_ValidateAutoReloadPreload(const tim_arpe_t autoReloadPreload)
{
	//! Restrict ARPE input to the two public binary selectors.
	if (TIM_ARPE_IS_VALID(autoReloadPreload) != 0x00U)
	{
		return DRIVER_STATUS_SUCCESS;
	}
	else
	{
		return DRIVER_STATUS_ERROR_INVALID_ARG;
	}
}

/**
 * @brief Validates a Timer update request source selector
 * @param[in] updateSource Timer update request source selector
 * @returns @ref driver_status_t "Update-source validation status"
 * @retval - @ref `DRIVER_STATUS_SUCCESS`: @p updateSource is valid
 * @retval - @ref `DRIVER_STATUS_ERROR_INVALID_ARG`: @p updateSource is invalid
 */
__STATIC_FORCEINLINE driver_status_t _TIM_ValidateUpdateSource(const tim_update_source_t updateSource)
{
	//! Reject raw URS encodings that are outside the public update-source vocabulary.
	if (TIM_UPDATE_SOURCE_IS_VALID(updateSource) != 0x00U)
	{
		return DRIVER_STATUS_SUCCESS;
	}
	else
	{
		return DRIVER_STATUS_ERROR_INVALID_ARG;
	}
}

/**
 * @brief Validates a Timer digital-filter sampling-clock division selector
 * @param[in] digitalFilterClockDivision Digital-filter clock-division selector
 * @returns @ref driver_status_t "Digital-filter clock-division validation status"
 * @retval - @ref `DRIVER_STATUS_SUCCESS`: @p digitalFilterClockDivision is valid
 * @retval - @ref `DRIVER_STATUS_ERROR_INVALID_ARG`: @p digitalFilterClockDivision is invalid
 */
__STATIC_FORCEINLINE driver_status_t _TIM_ValidateDigitalFilterClockDivision(const tim_digital_filter_clock_division_t digitalFilterClockDivision)
{
	//! Reject the reserved CKD encoding before CR1 staging.
	if (TIM_DIGITAL_FILTER_CLOCK_DIVISION_IS_VALID(digitalFilterClockDivision) != 0x00U)
	{
		return DRIVER_STATUS_SUCCESS;
	}
	else
	{
		return DRIVER_STATUS_ERROR_INVALID_ARG;
	}
}

/**
 * @brief Validates a Timer counter configuration pointer and all public selectors
 * @param[in] pCounter Timer counter configuration
 * @returns @ref driver_status_t "Counter-configuration validation status"
 * @retval - @ref `DRIVER_STATUS_SUCCESS`: @p pCounter is valid
 * @retval - @ref `DRIVER_STATUS_ERROR_NULL_PTR`: @p pCounter is `NULL`
 * @retval - @ref `DRIVER_STATUS_ERROR_INVALID_ARG`: One or more selectors are invalid
 */
__STATIC_FORCEINLINE driver_status_t _TIM_ValidateCounterConfig(const tim_config_counter_t* const pCounter)
{
	//! Validate the container before reading any grouped selector fields.
	if (pCounter == NULL)
	{
		return DRIVER_STATUS_ERROR_NULL_PTR;
	}

