GodSpeeD-17/STM32F103C8T6_BareMetal/BareMetal/Driver/Timer/Src/timer.c
	//! Reuse scalar selector validators so grouped and scalar APIs share the same validation path.
	ASSERT_DRIVER_STATUS(_TIM_ValidateDirection(pCounter->direction));
	ASSERT_DRIVER_STATUS(_TIM_ValidateAlignment(pCounter->alignment));
	ASSERT_DRIVER_STATUS(_TIM_ValidateOnePulse(pCounter->one_pulse));
	ASSERT_DRIVER_STATUS(_TIM_ValidateAutoReloadPreload(pCounter->auto_reload_preload));
	ASSERT_DRIVER_STATUS(_TIM_ValidateUpdateSource(pCounter->update_source));
	ASSERT_DRIVER_STATUS(_TIM_ValidateDigitalFilterClockDivision(pCounter->digital_filter_clock_division));

	return DRIVER_STATUS_SUCCESS;
}

/**
 * @brief Validates a Timer ON/OFF state selector
 * @param[in] state Timer state selector
 * @returns @ref driver_status_t "Binary-state validation status"
 * @retval - @ref `DRIVER_STATUS_SUCCESS`: @p state is @ref `DRIVER_STATUS_OFF` or @ref `DRIVER_STATUS_ON`
 * @retval - @ref `DRIVER_STATUS_ERROR_INVALID_ARG`: @p state is invalid
 */
__STATIC_FORCEINLINE driver_status_t _TIM_ValidateState(const driver_status_t state)
{
	//! Public binary-state APIs accept only OFF and ON, never generic error statuses.
	if ((state == DRIVER_STATUS_OFF) || (state == DRIVER_STATUS_ON))
	{
		return DRIVER_STATUS_SUCCESS;
	}
	else
	{
		return DRIVER_STATUS_ERROR_INVALID_ARG;
	}
}

/**
 * @brief Validates a non-empty Timer interrupt-request source mask
 * @param[in] irqSources Timer interrupt-request sources to validate
 * @returns @ref driver_status_t "IRQ-source validation status"
 * @retval - @ref `DRIVER_STATUS_SUCCESS`: @p irqSources contains only supported sources
 * @retval - @ref `DRIVER_STATUS_ERROR_INVALID_ARG`: @p irqSources is empty or contains unsupported sources
 */
__STATIC_FORCEINLINE driver_status_t _TIM_ValidateIRQSources(const tim_irq_source_t irqSources)
{
	//! Require at least one source and reject every bit outside the public DIER vocabulary.
	if ((irqSources == TIMx_IRQ_SOURCE_NONE) || ((((uint32_t) irqSources) & (~((uint32_t) TIMx_IRQ_SOURCE_ALL))) != 0x00UL))
	{
		return DRIVER_STATUS_ERROR_INVALID_ARG;
	}

	return DRIVER_STATUS_SUCCESS;
}

// ==================================================================================================== //
//										Local RCC Integration Helpers									//
// ==================================================================================================== //

/**
 * @brief Decodes the APB1 clock enable mask for one Timer instance
 * @param[in] TIMx Timer peripheral instance
 * Accepted values:
 * - `TIM2`
 * - `TIM3`
 * - `TIM4`
 * @param[out] pClockEnableMask Destination for the APB1 clock enable mask
 * Expected values:
 * - Non-`NULL`: Decoded APB1 clock enable mask is written to @p `pClockEnableMask`
 * @returns @ref driver_status_t "APB1 clock-mask decode status"
 * @retval - @ref `DRIVER_STATUS_SUCCESS`: APB1 clock enable mask was decoded
 * @retval - @ref `DRIVER_STATUS_ERROR_NULL_PTR`: @p `TIMx` or @p `pClockEnableMask` is `NULL`
 * @retval - @ref `DRIVER_STATUS_ERROR_INVALID_ARG`: @p `TIMx` is not supported
 */
__STATIC_FORCEINLINE driver_status_t _TIM_DecodeAPB1ClockEnableMask(const TIM_TypeDef* const TIMx, reg* const pClockEnableMask)
{
	//! Validate the instance before resolving its RCC clock gate.
	if (pClockEnableMask == NULL)
	{
		return DRIVER_STATUS_ERROR_NULL_PTR;
	}
	ASSERT_DRIVER_STATUS(_TIM_ValidateInstance(TIMx));

	//! Compare pointer-width addresses so the instance lookup matches the uintptr_t base definitions.
	switch ((uintptr_t) TIMx)
	{
		case TIM2_BASE_ADDRESS:
		{
			*pClockEnableMask = RCC_APB1ENR_TIM2EN;
			break;
		}
		case TIM3_BASE_ADDRESS:
		{
			*pClockEnableMask = RCC_APB1ENR_TIM3EN;
			break;
		}
		case TIM4_BASE_ADDRESS:
		{
			*pClockEnableMask = RCC_APB1ENR_TIM4EN;
			break;
		}
		default:
		{
			return DRIVER_STATUS_ERROR_INVALID_ARG;
		}
	}

	return DRIVER_STATUS_SUCCESS;
}

/**
 * @brief Decodes the APB1 peripheral reset mask for one Timer instance
 * @param[in] TIMx Timer peripheral instance
 * Accepted values:
 * - `TIM2`
 * - `TIM3`
 * - `TIM4`
 * @param[out] pPeripheralResetMask Destination for the APB1 peripheral reset mask
 * Expected values:
 * - Non-`NULL`: Decoded APB1 peripheral reset mask is written to @p `pPeripheralResetMask`
 * @returns @ref driver_status_t "APB1 peripheral-reset-mask decode status"
 * @retval - @ref `DRIVER_STATUS_SUCCESS`: APB1 peripheral reset mask was decoded
 * @retval - @ref `DRIVER_STATUS_ERROR_NULL_PTR`: @p `TIMx` or @p `pPeripheralResetMask` is `NULL`
 * @retval - @ref `DRIVER_STATUS_ERROR_INVALID_ARG`: @p `TIMx` is not supported
 */
__STATIC_FORCEINLINE driver_status_t _TIM_DecodeAPB1PeripheralResetMask(const TIM_TypeDef* const TIMx, reg* const pPeripheralResetMask)
{
	//! Validate destination storage before decoding the instance address.
	if (pPeripheralResetMask == NULL)
	{
		return DRIVER_STATUS_ERROR_NULL_PTR;
	}
	ASSERT_DRIVER_STATUS(_TIM_ValidateInstance(TIMx));

	//! Match by peripheral base address so deconfiguration cannot pulse an unrelated peripheral reset.
	switch ((uintptr_t) TIMx)
	{
		case TIM2_BASE_ADDRESS:
		{
			*pPeripheralResetMask = RCC_APB1RSTR_TIM2RST;
			break;
		}
		case TIM3_BASE_ADDRESS:
		{
			*pPeripheralResetMask = RCC_APB1RSTR_TIM3RST;
			break;
		}
		case TIM4_BASE_ADDRESS:
		{
			*pPeripheralResetMask = RCC_APB1RSTR_TIM4RST;
			break;
		}
		default:
		{
			return DRIVER_STATUS_ERROR_INVALID_ARG;
		}
	}

	return DRIVER_STATUS_SUCCESS;
}

/**
 * @brief Validates that the Timer APB1 clock gate is enabled
 * @param[in] TIMx Timer peripheral instance
 * @returns @ref driver_status_t "Clock-gate validation status"
 * @retval - @ref `DRIVER_STATUS_SUCCESS`: Timer APB1 clock gate is enabled
 * @retval - @ref `DRIVER_STATUS_ERROR_NULL_PTR`: @p TIMx is `NULL`
 * @retval - @ref `DRIVER_STATUS_ERROR_INVALID_ARG`: @p TIMx is not supported
 * @retval - @ref `DRIVER_STATUS_ERROR_STATE`: Timer APB1 clock gate is disabled
 */
__STATIC_FORCEINLINE driver_status_t _TIM_ValidateClockEnabled(TIM_TypeDef* const TIMx)
{
	//! Resolve and sample the APB1 enable bit without touching Timer registers.
	reg clockEnableMask = 0x00000000UL;
	driver_status_t clockState = DRIVER_STATUS_ERROR;
	ASSERT_DRIVER_STATUS(_TIM_DecodeAPB1ClockEnableMask(TIMx, &clockEnableMask));

	//! Read the RCC APB1 clock-enable bit for the requested Timer
	clockState = RCC_GetPeripheralClockState(RCC_APB1_BUS, clockEnableMask);
	if (clockState != DRIVER_STATUS_ERROR_INVALID_ARG)
	{
		if (clockState == DRIVER_STATUS_ON)
		{
			clockState = DRIVER_STATUS_SUCCESS;
		}
		else
		{
			clockState = DRIVER_STATUS_ERROR_STATE;
		}
	}

