GodSpeeD-17/STM32F103C8T6_BareMetal/BareMetal/Driver/Timer/Src/timer.c
	return clockState;
}

/**
 * @brief Validates that one caller-owned `TIMx_CR1` image represents a stopped counter
 * @param[in] controlRegisterImage Caller-owned `TIMx_CR1` image
 * @returns @ref driver_status_t "Counter-image validation status"
 * @retval - @ref `DRIVER_STATUS_SUCCESS`: `TIMx_CR1.CEN` is cleared
 * @retval - @ref `DRIVER_STATUS_ERROR_INVALID_ARG`: `TIMx_CR1.CEN` could not be decoded
 * @retval - @ref `DRIVER_STATUS_ERROR_BUSY`: `TIMx_CR1.CEN` is set
 * @note This helper performs no MMIO.
 */
__STATIC_FORCEINLINE driver_status_t _TIM_ValidateCounterStoppedImage(const reg controlRegisterImage)
{
	// Local Variable
	driver_status_t counterState = DRIVER_STATUS_ERROR;

	//! Decode and validate CEN without collapsing an unexpected Codec status into BUSY.
	counterState = Codec_TIM_ExtractCounterEnableState(controlRegisterImage);
	ASSERT_DRIVER_STATUS(_TIM_ValidateState(counterState));

	//! Treat an enabled counter image as a busy configuration transaction.
	if (counterState == DRIVER_STATUS_OFF)
	{
		return DRIVER_STATUS_SUCCESS;
	}
	else
	{
		return DRIVER_STATUS_ERROR_BUSY;
	}
}

/**
 * @brief Validates that the live Timer counter is stopped before a timing-mode transition
 * @param[in] TIMx Timer peripheral instance
 * @returns @ref driver_status_t "Counter-state validation status"
 * @retval - @ref `DRIVER_STATUS_SUCCESS`: Timer clock is enabled and the counter is stopped
 * @retval - @ref `DRIVER_STATUS_ERROR_NULL_PTR`: @p TIMx is `NULL`
 * @retval - @ref `DRIVER_STATUS_ERROR_INVALID_ARG`: @p TIMx is unsupported
 * @retval - @ref `DRIVER_STATUS_ERROR_STATE`: Timer APB1 clock gate is disabled
 * @retval - @ref `DRIVER_STATUS_ERROR_BUSY`: Timer counter is running
 */
__STATIC_FORCEINLINE driver_status_t _TIM_ValidateCounterStopped(TIM_TypeDef* const TIMx)
{
	//! CEN is readable only while the Timer clock gate is available.
	ASSERT_DRIVER_STATUS(_TIM_ValidateClockEnabled(TIMx));
	//! Reuse image validation after taking the one live CR1 snapshot owned by this check.
	return _TIM_ValidateCounterStoppedImage(LL_TIM_ReadCR1(TIMx));
}

/**
 * @brief Validates that selected channel events belong to an output-compare lane
 * @param[in] ccmrRegImage Caller-owned `CCMR1` or `CCMR2` image
 * @param[in] channel Timer channel represented by @p channelEvents
 * @param[in] channelEvents Capture/compare and overcapture events for @p channel
 * @param[in] irqEvents Requested event acknowledgement mask
 * @returns @ref driver_status_t "Channel-event acknowledgement validation status"
 * @retval - @ref `DRIVER_STATUS_SUCCESS`: No selected event would discard an unread capture
 * @retval - @ref `DRIVER_STATUS_ERROR_INVALID_ARG`: The channel selector could not be decoded
 * @retval - @ref `DRIVER_STATUS_ERROR_STATE`: A selected event belongs to an input-capture lane
 */
__STATIC_FORCEINLINE driver_status_t _TIM_ValidateChannelEventAckMode
(
	const reg				ccmrRegImage,
	const tim_channel_t		channel,
	const tim_event_flag_t	channelEvents,
	const tim_event_flag_t	irqEvents
)
{
	// Local Variable
	tim_channel_ccs_t captureCompareSelection = TIMx_CHANNEL_CCS_OUTPUT;

	//! Skip channel-mode decoding when no event for this lane was selected.
	if ((irqEvents & channelEvents) == TIMx_IRQ_EVENT_NONE)
	{
		return DRIVER_STATUS_SUCCESS;
	}

	ASSERT_DRIVER_STATUS
	(
		Codec_TIM_ExtractChannelSelection
		(
			ccmrRegImage,
			channel,
			&captureCompareSelection
		)
	);
	//! Generic W0C acknowledgement must not discard an unread input-capture notification.
	if (captureCompareSelection != TIMx_CHANNEL_CCS_OUTPUT)
	{
		return DRIVER_STATUS_ERROR_STATE;
	}

	return DRIVER_STATUS_SUCCESS;
}

/**
 * @brief Validates capture/compare event acknowledgement against live channel modes
 * @param[in] TIMx Timer peripheral instance with an enabled clock gate
 * @param[in] irqEvents Validated event flags requested for acknowledgement
 * @returns @ref driver_status_t "IRQ-event acknowledgement validation status"
 * @retval - @ref `DRIVER_STATUS_SUCCESS`: Selected channel events are safe to acknowledge generically
 * @retval - @ref `DRIVER_STATUS_ERROR_INVALID_ARG`: A channel selector could not be decoded
 * @retval - @ref `DRIVER_STATUS_ERROR_STATE`: A selected event belongs to an input-capture lane
 */
__STATIC_FORCEINLINE driver_status_t _TIM_ValidateIRQEventAckMode(TIM_TypeDef* const TIMx, const tim_event_flag_t irqEvents)
{
	// Local Variable
	reg ccmrRegImage = 0x00000000UL;

	//! Read CCMR1 only when channel 1 or 2 event semantics must be classified.
	if ((irqEvents & (TIMx_IRQ_EVENT_CC1 | TIMx_IRQ_EVENT_CC2 | TIMx_IRQ_EVENT_CC1_OVERCAPTURE | TIMx_IRQ_EVENT_CC2_OVERCAPTURE)) != TIMx_IRQ_EVENT_NONE)
	{
		ccmrRegImage = LL_TIM_ReadCCMR1(TIMx);
		ASSERT_DRIVER_STATUS
		(
			_TIM_ValidateChannelEventAckMode
			(
				ccmrRegImage,
				TIMx_CHANNEL_1,
				TIMx_IRQ_EVENT_CC1 | TIMx_IRQ_EVENT_CC1_OVERCAPTURE,
				irqEvents
			)
		);
		ASSERT_DRIVER_STATUS
		(
			_TIM_ValidateChannelEventAckMode
			(
				ccmrRegImage,
				TIMx_CHANNEL_2,
				TIMx_IRQ_EVENT_CC2 | TIMx_IRQ_EVENT_CC2_OVERCAPTURE,
				irqEvents
			)
		);
	}

	//! Read CCMR2 only when channel 3 or 4 event semantics must be classified.
	if
	(
		(irqEvents &
		(
			TIMx_IRQ_EVENT_CC3 |
			TIMx_IRQ_EVENT_CC4 |
			TIMx_IRQ_EVENT_CC3_OVERCAPTURE |
			TIMx_IRQ_EVENT_CC4_OVERCAPTURE
		)) != TIMx_IRQ_EVENT_NONE
	)
	{
		ccmrRegImage = LL_TIM_ReadCCMR2(TIMx);
		ASSERT_DRIVER_STATUS
		(
			_TIM_ValidateChannelEventAckMode
			(
				ccmrRegImage,
				TIMx_CHANNEL_3,
				TIMx_IRQ_EVENT_CC3 | TIMx_IRQ_EVENT_CC3_OVERCAPTURE,
				irqEvents
			)
		);
		ASSERT_DRIVER_STATUS
		(
			_TIM_ValidateChannelEventAckMode
			(
				ccmrRegImage,
				TIMx_CHANNEL_4,
				TIMx_IRQ_EVENT_CC4 | TIMx_IRQ_EVENT_CC4_OVERCAPTURE,
				irqEvents
			)
		);
	}

	return DRIVER_STATUS_SUCCESS;
}

// ==================================================================================================== //
//										Local Dirty Write Helpers										//
// ==================================================================================================== //

/**
 * @brief Writes `TIMx_CR1` only when the staged image changed
 * @param[in] TIMx Timer peripheral instance
 * Accepted values:
 * - `TIM2`
 * - `TIM3`
 * - `TIM4`
 * @param[in] currentRegImage Current hardware `CR1` image
 * @param[in] stagedRegImage Staged `CR1` image
 * @returns @ref driver_status_t "CR1 dirty-write operation status"
 * @retval - @ref `DRIVER_STATUS_SUCCESS`: `CR1` write was skipped or performed
 * @retval - @ref `DRIVER_STATUS_ERROR_NULL_PTR`: @p `TIMx` is `NULL`
 * @retval - @ref `DRIVER_STATUS_ERROR_INVALID_ARG`: @p `TIMx` is not supported
 * @note Caller owns Timer clock-gate availability before invoking this helper
 */
__STATIC_FORCEINLINE driver_status_t _TIM_WriteCR1IfChanged
(
	TIM_TypeDef* const	TIMx,
	const reg			currentRegImage,
	const reg			stagedRegImage
)
{
	//! Validate the instance before deriving its CR1 register address.
	ASSERT_DRIVER_STATUS(_TIM_ValidateInstance(TIMx));
	//! Delegate the generic comparison/write policy while retaining Timer-specific address selection.
	return RegOps_WriteIfChanged(LL_TIM_REG(TIMx, CR1), currentRegImage, stagedRegImage);
}

/**
 * @brief Writes `TIMx_PSC` only when the staged image changed
 * @param[in] TIMx Timer peripheral instance
 * Accepted values:
 * - `TIM2`
 * - `TIM3`
 * - `TIM4`
 * @param[in] currentRegImage Current hardware `PSC` image
 * @param[in] stagedRegImage Staged `PSC` image
 * @returns @ref driver_status_t "PSC dirty-write operation status"
 * @retval - @ref `DRIVER_STATUS_SUCCESS`: `PSC` write was skipped or performed
 * @retval - @ref `DRIVER_STATUS_ERROR_NULL_PTR`: @p `TIMx` is `NULL`
 * @retval - @ref `DRIVER_STATUS_ERROR_INVALID_ARG`: @p `TIMx` is not supported
 * @note Caller owns Timer clock-gate availability before invoking this helper
 */
__STATIC_FORCEINLINE driver_status_t _TIM_WritePSCIfChanged
(
	TIM_TypeDef* const	TIMx,
	const reg			currentRegImage,
	const reg			stagedRegImage
)
{
	//! Validate the instance before deriving its PSC register address.
	ASSERT_DRIVER_STATUS(_TIM_ValidateInstance(TIMx));
	//! Delegate the generic comparison/write policy while retaining Timer-specific address selection.
	return RegOps_WriteIfChanged(LL_TIM_SCALAR_REG(TIMx, PSC), currentRegImage, stagedRegImage);
}

/**
 * @brief Writes `TIMx_ARR` only when the staged image changed
 * @param[in] TIMx Timer peripheral instance
 * Accepted values:
 * - `TIM2`
 * - `TIM3`
 * - `TIM4`
 * @param[in] currentRegImage Current hardware `ARR` image
 * @param[in] stagedRegImage Staged `ARR` image
 * @returns @ref driver_status_t "ARR dirty-write operation status"
 * @retval - @ref `DRIVER_STATUS_SUCCESS`: `ARR` write was skipped or performed
 * @retval - @ref `DRIVER_STATUS_ERROR_NULL_PTR`: @p `TIMx` is `NULL`
 * @retval - @ref `DRIVER_STATUS_ERROR_INVALID_ARG`: @p `TIMx` is not supported
 * @note Caller owns Timer clock-gate availability before invoking this helper
 */
__STATIC_FORCEINLINE driver_status_t _TIM_WriteARRIfChanged
(
	TIM_TypeDef* const	TIMx,
	const reg			currentRegImage,
	const reg			stagedRegImage
)
{
	//! Validate the instance before deriving its ARR register address.
	ASSERT_DRIVER_STATUS(_TIM_ValidateInstance(TIMx));
	//! Delegate the generic comparison/write policy while retaining Timer-specific address selection.
	return RegOps_WriteIfChanged(LL_TIM_SCALAR_REG(TIMx, ARR), currentRegImage, stagedRegImage);
}

/**
 * @brief Writes `TIMx_CNT` only when the staged image changed
 * @param[in] TIMx Timer peripheral instance
 * Accepted values:
 * - `TIM2`
 * - `TIM3`
 * - `TIM4`
 * @param[in] currentRegImage Current hardware `CNT` image
 * @param[in] stagedRegImage Staged `CNT` image
 * @returns @ref driver_status_t "CNT dirty-write operation status"
 * @retval - @ref `DRIVER_STATUS_SUCCESS`: `CNT` write was skipped or performed
 * @retval - @ref `DRIVER_STATUS_ERROR_NULL_PTR`: @p `TIMx` is `NULL`
 * @retval - @ref `DRIVER_STATUS_ERROR_INVALID_ARG`: @p `TIMx` is not supported
 * @note Caller owns Timer clock-gate availability before invoking this helper
 */
__STATIC_FORCEINLINE driver_status_t _TIM_WriteCNTIfChanged
(
	TIM_TypeDef* const	TIMx,
	const reg			currentRegImage,
	const reg			stagedRegImage
)
{
	//! Validate the instance before deriving its CNT register address.
	ASSERT_DRIVER_STATUS(_TIM_ValidateInstance(TIMx));
	//! Delegate the generic comparison/write policy while retaining Timer-specific address selection.
	return RegOps_WriteIfChanged(LL_TIM_SCALAR_REG(TIMx, CNT), currentRegImage, stagedRegImage);
}

// ==================================================================================================== //
//										Local Update Event Helpers										//
// ==================================================================================================== //

/**
 * @brief Clears `TIMx_SR.UIF` when a generated update event set it
 * @param[in] TIMx Timer peripheral instance
 * @returns @ref driver_status_t "Driver operation status"
 * @retval - @ref `DRIVER_STATUS_SUCCESS`: Update flag was clear or was acknowledged
 * @retval - @ref `DRIVER_STATUS_ERROR_NULL_PTR`: @p TIMx is `NULL`
 * @retval - @ref `DRIVER_STATUS_ERROR_INVALID_ARG`: @p TIMx is not supported
 * @note Caller owns Timer clock-gate availability before invoking this helper.
 */
__STATIC_FORCEINLINE driver_status_t _TIM_ClearUpdateFlagIfPending(TIM_TypeDef* const TIMx)
{
	// Local Variables
	reg srRegImage = 0x00UL;
	driver_status_t updateFlagState = DRIVER_STATUS_ERROR;

	// Validate Input
	ASSERT_DRIVER_STATUS(_TIM_ValidateInstance(TIMx));

	//! Decode the current UIF state without collapsing an unexpected Codec status.
	srRegImage = LL_TIM_ReadSR(TIMx);
	updateFlagState = Codec_TIM_ExtractUpdateFlagState(srRegImage);
	ASSERT_DRIVER_STATUS(_TIM_ValidateState(updateFlagState));

	//! The update flag may or may not be set by UG depending on Timer state; avoid writing SR unless needed.
	if (updateFlagState == DRIVER_STATUS_ON)
	{
		//! Stage write-0-to-clear semantics through the codec so the driver does not encode SR flag policy.
		ASSERT_DRIVER_STATUS(Codec_TIM_StageUpdateFlagClear(&srRegImage));
		LL_TIM_WriteSR(TIMx, srRegImage);
	}

	return DRIVER_STATUS_SUCCESS;
}

/**
 * @brief Aborts one incomplete blocking delay and clears its update flag
 * @param[in] TIMx Timer peripheral instance
 * Accepted values:
 * - `TIM2`
 * - `TIM3`
 * - `TIM4`
 * @returns @ref driver_status_t "Blocking-delay abort status"
 * @retval - @ref `DRIVER_STATUS_SUCCESS`: Counter operation and `UIF` were cleared after an incomplete delay
 * @retval - @ref `DRIVER_STATUS_ERROR_NULL_PTR`: @p TIMx is `NULL`
 * @retval - @ref `DRIVER_STATUS_ERROR_INVALID_ARG`: @p TIMx is invalid or Timer state could not be decoded
 * @retval - @ref `DRIVER_STATUS_ERROR_STATE`: Timer APB1 clock gate is disabled
 * @pre @p TIMx retains the dedicated blocking-delay configuration established by
 * @ref TIM_ConfigForBlockingDelay
 */
__STATIC_FORCEINLINE driver_status_t _TIM_CleanupBlockingDelayState(TIM_TypeDef* const TIMx)
{
	// Local Variables
	reg currentControlRegisterImage = 0x00000000UL;
	reg targetControlRegisterImage = 0x00000000UL;

