GodSpeeD-17/STM32F103C8T6_BareMetal/BareMetal/Driver/Timer/Src/timer.c
	//! Abort incomplete counter operation while preserving the dedicated blocking-delay configuration.
	ASSERT_DRIVER_STATUS(_TIM_ValidateClockEnabled(TIMx));
	currentControlRegisterImage = LL_TIM_ReadCR1(TIMx);
	targetControlRegisterImage = currentControlRegisterImage;
	ASSERT_DRIVER_STATUS(Codec_TIM_StageCounterEnableState(&targetControlRegisterImage, DRIVER_STATUS_OFF));

	//! Dirty-write CEN, then remove any update flag that raced with the abort.
	ASSERT_DRIVER_STATUS(_TIM_WriteCR1IfChanged(TIMx, currentControlRegisterImage, targetControlRegisterImage));
	return _TIM_ClearUpdateFlagIfPending(TIMx);
}

/**
 * @brief Polls one dedicated blocking-delay Timer until its update flag is asserted
 * @param[in] TIMx Timer peripheral instance
 * Accepted values:
 * - `TIM2`
 * - `TIM3`
 * - `TIM4`
 * @param[in] pollsRemaining Maximum number of clear-flag samples to tolerate
 * Accepted values:
 * - `1U..0xFFFFFFFFU`: Bounded polling budget
 * @returns @ref driver_status_t "Delay-polling operation status"
 * @retval - @ref `DRIVER_STATUS_SUCCESS`: `TIMx_SR.UIF` was asserted
 * @retval - @ref `DRIVER_STATUS_ERROR_TIMEOUT`: Polling budget expired before `TIMx_SR.UIF` was asserted
 * @pre The caller validated @p TIMx and its clock-gate state
 */
__STATIC_FORCEINLINE driver_status_t _TIM_PollBlockingDelayCompletion(TIM_TypeDef* const TIMx, uint32_t	pollsRemaining)
{
	driver_status_t updateFlagState = DRIVER_STATUS_OFF;

	while (pollsRemaining > 0UL)
	{
		//! Sample UIF until hardware completes the one-pulse blocking delay.
		updateFlagState = Codec_TIM_ExtractUpdateFlagState(LL_TIM_ReadSR(TIMx));
		if (updateFlagState == DRIVER_STATUS_ON)
		{
			return DRIVER_STATUS_SUCCESS;
		}

		//! Consume one bounded blocking sample only when the completion flag remained clear.
		pollsRemaining--;
	}

	return DRIVER_STATUS_ERROR_TIMEOUT;
}

// ==================================================================================================== //
//									Local Configuration Staging									//
// ==================================================================================================== //

/**
 * @brief Stages the Timer control and action images required to commit a timebase update
 * @param[in,out] pCommitControlRegisterImage Caller-owned temporary `TIMx_CR1` commit image
 * Accepted values:
 * - Non-`NULL`: Mutable `TIMx_CR1` image
 * @param[in,out] pUpdateEventRegisterImage Caller-owned write-only `TIMx_EGR` action image
 * Accepted values:
 * - Non-`NULL`: Mutable `TIMx_EGR` image
 * @returns @ref driver_status_t "Timebase-update staging status"
 * @retval - @ref `DRIVER_STATUS_SUCCESS`: Timebase-update policy and action images were staged
 * @retval - @ref `DRIVER_STATUS_ERROR_NULL_PTR`: A register-image pointer is `NULL`
 * @note This helper performs no MMIO and publishes both images only after all staging succeeds.
 */
__STATIC_FORCEINLINE driver_status_t _TIM_StageTimeBaseUpdate
(
	reg* const	pCommitControlRegisterImage,
	reg* const	pUpdateEventRegisterImage
)
{
	//! Validate both caller-owned images before staging locally.
	if ((pCommitControlRegisterImage == NULL) || (pUpdateEventRegisterImage == NULL))
	{
		return DRIVER_STATUS_ERROR_NULL_PTR;
	}

	// Local Variables
	reg commitControlRegisterImage = *pCommitControlRegisterImage;
	reg updateEventRegisterImage = *pUpdateEventRegisterImage;

	//! Stage the non-requesting software-update policy and write-only UG action.
	ASSERT_DRIVER_STATUS(Codec_TIM_StageUpdateEventState(&commitControlRegisterImage, DRIVER_STATUS_ON));
	ASSERT_DRIVER_STATUS(Codec_TIM_StageUpdateSource(&commitControlRegisterImage, TIMx_UPDATE_SOURCE_OVERFLOW_UNDERFLOW_ONLY));
	ASSERT_DRIVER_STATUS(Codec_TIM_StageUpdateEventGeneration(&updateEventRegisterImage));

	*pCommitControlRegisterImage = commitControlRegisterImage;
	*pUpdateEventRegisterImage = updateEventRegisterImage;
	return DRIVER_STATUS_SUCCESS;
}

/**
 * @brief Stages one complete Timer timebase configuration
 * @param[in] pTimeBaseConfig Timer timebase configuration to stage
 * Accepted values:
 * - Non-`NULL`: Complete Timer timebase configuration
 * @param[in,out] pPrescalerRegisterImage Caller-owned `TIMx_PSC` image
 * Accepted values:
 * - Non-`NULL`: Mutable `TIMx_PSC` image
 * @param[in,out] pAutoReloadRegisterImage Caller-owned `TIMx_ARR` image
 * Accepted values:
 * - Non-`NULL`: Mutable `TIMx_ARR` image
 * @param[in,out] pCounterRegisterImage Caller-owned `TIMx_CNT` image
 * Accepted values:
 * - Non-`NULL`: Mutable `TIMx_CNT` image
 * @returns @ref driver_status_t "Timebase-staging operation status"
 * @retval - @ref `DRIVER_STATUS_SUCCESS`: Complete timebase register images were staged
 * @retval - @ref `DRIVER_STATUS_ERROR_NULL_PTR`: A configuration or register-image pointer is `NULL`
 * @note This helper performs no MMIO and owns only the fields represented by
 * @ref tim_config_timebase_t
 */
__STATIC_FORCEINLINE driver_status_t _TIM_StageTimeBaseConfig
(
	const tim_config_timebase_t* const	pTimeBaseConfig,
	reg* const							pPrescalerRegisterImage,
	reg* const							pAutoReloadRegisterImage,
	reg* const							pCounterRegisterImage
)
{
	//! Validate every caller-owned object before reading or publishing an image.
	if
	(
		(pTimeBaseConfig == NULL) || (pPrescalerRegisterImage == NULL) ||
		(pAutoReloadRegisterImage == NULL) || (pCounterRegisterImage == NULL)
	)
	{
		return DRIVER_STATUS_ERROR_NULL_PTR;
	}

	// Local Variables
	reg prescalerRegisterImage = *pPrescalerRegisterImage;
	reg autoReloadRegisterImage = *pAutoReloadRegisterImage;
	reg counterRegisterImage = *pCounterRegisterImage;

	//! Stage only the register images represented by the timebase structure.
	ASSERT_DRIVER_STATUS
	(
		Codec_TIM_StageTimeBaseConfig
		(
			&prescalerRegisterImage,
			&autoReloadRegisterImage,
			&counterRegisterImage,
			pTimeBaseConfig
		)
	);

	//! Publish every timebase image only after the grouped Codec stage succeeds.
	*pPrescalerRegisterImage = prescalerRegisterImage;
	*pAutoReloadRegisterImage = autoReloadRegisterImage;
	*pCounterRegisterImage = counterRegisterImage;

	return DRIVER_STATUS_SUCCESS;
}

/**
 * @brief Stages one complete Timer counter configuration image
 * @param[in] pCounterConfig Timer counter configuration to stage
 * Accepted values:
 * - Non-`NULL`: Complete validated Timer counter configuration
 * @param[in,out] pControlRegisterImage Caller-owned `TIMx_CR1` image
 * Accepted values:
 * - Non-`NULL`: Mutable cached `TIMx_CR1` image
 * @returns @ref driver_status_t "Counter-staging operation status"
 * @retval - @ref `DRIVER_STATUS_SUCCESS`: Complete counter configuration image was staged
 * @retval - @ref `DRIVER_STATUS_ERROR_NULL_PTR`: @p pCounterConfig or @p pControlRegisterImage is `NULL`
 * @retval - @ref `DRIVER_STATUS_ERROR_INVALID_ARG`: One or more counter selectors are invalid
 * @retval - @ref `DRIVER_STATUS_ERROR_STATE`: Direction cannot change while the current mode is center-aligned
 * @note This helper performs no MMIO and publishes its output only after all staging succeeds.
 */
__STATIC_FORCEINLINE driver_status_t _TIM_StageCounterConfig
(
	const tim_config_counter_t* const	pCounterConfig,
	reg* const							pControlRegisterImage
)
{
	//! Validate the complete domain and destination before staging the target image.
	ASSERT_DRIVER_STATUS(_TIM_ValidateCounterConfig(pCounterConfig));
	if (pControlRegisterImage == NULL)
	{
		return DRIVER_STATUS_ERROR_NULL_PTR;
	}

	// Local Variables
	reg targetControlRegisterImage = *pControlRegisterImage;
	tim_config_counter_t currentCounterConfig;

	ASSERT_DRIVER_STATUS(Codec_TIM_ExtractCounterConfig(targetControlRegisterImage, &currentCounterConfig));

