GodSpeeD-17/STM32F103C8T6_BareMetal/BareMetal/Driver/Timer/Src/timer.c
	//! Reject a direction change that hardware cannot accept in the current center-aligned mode.
	if
	(
		(currentCounterConfig.alignment != TIMx_MODE_NORMAL) &&
		(currentCounterConfig.direction != pCounterConfig->direction)
	)
	{
		return DRIVER_STATUS_ERROR_STATE;
	}

	//! Coalesce the complete counter domain into one final CR1 image.
	ASSERT_DRIVER_STATUS(Codec_TIM_StageCounterConfig(&targetControlRegisterImage, pCounterConfig));

	//! Publish the target only after every fallible transformation succeeds.
	*pControlRegisterImage = targetControlRegisterImage;

	return DRIVER_STATUS_SUCCESS;
}

// ==================================================================================================== //
//										Timer Operation State APIs										//
// ==================================================================================================== //

// ------------------------------------ Timer Operation State Pair ------------------------------------ //

driver_status_t TIM_GetOperationState(TIM_TypeDef* const TIMx)
{
	//! Operation state is CR1.CEN; the Timer clock gate must be enabled before CR1 can be read.
	ASSERT_DRIVER_STATUS(_TIM_ValidateClockEnabled(TIMx));
	return Codec_TIM_ExtractCounterEnableState(LL_TIM_ReadCR1(TIMx));
}

driver_status_t TIM_SetOperationState(TIM_TypeDef* const TIMx, const driver_status_t operationState)
{
	// Local Variables
	reg currentControlRegisterImage = 0x00000000UL;
	reg stagedControlRegisterImage = 0x00000000UL;

	//! Operation state owns only CR1.CEN; it refuses to touch CR1 while the Timer clock gate is off.
	ASSERT_DRIVER_STATUS(_TIM_ValidateClockEnabled(TIMx));
	ASSERT_DRIVER_STATUS(_TIM_ValidateState(operationState));

	//! Snapshot CR1 once and stage only CEN while preserving every unrelated field.
	currentControlRegisterImage = LL_TIM_ReadCR1(TIMx);
	stagedControlRegisterImage = currentControlRegisterImage;
	ASSERT_DRIVER_STATUS(Codec_TIM_StageCounterEnableState(&stagedControlRegisterImage, operationState));

	//! Commit CR1 only when CEN changed.
	return _TIM_WriteCR1IfChanged(TIMx, currentControlRegisterImage, stagedControlRegisterImage);
}

// ==================================================================================================== //
//										Timer Root Configuration APIs									//
// ==================================================================================================== //

// ---------------------------------- Timer Root Configuration Pair ----------------------------------- //

driver_status_t TIM_DeConfig(TIM_TypeDef* const TIMx)
{
	// Local Variable
	reg peripheralResetMask = 0x00000000UL;

	//! Require explicit application clock ownership before resetting the Timer register bank.
	ASSERT_DRIVER_STATUS(_TIM_ValidateClockEnabled(TIMx));
	ASSERT_DRIVER_STATUS(_TIM_DecodeAPB1PeripheralResetMask(TIMx, &peripheralResetMask));

	//! Reset only Timer-owned peripheral state; RCC clock gating and NVIC delivery remain unchanged.
	return RCC_PulsePeripheralReset(RCC_APB1_BUS, peripheralResetMask);
}

driver_status_t TIM_Config(TIM_TypeDef* const TIMx, const tim_config_t* const pConfig)
{
	// Local Variables
	driver_status_t status = DRIVER_STATUS_SUCCESS;
	reg currentControlRegisterImage = 0x00000000UL;
	reg targetControlRegisterImage = 0x00000000UL;
	reg commitControlRegisterImage = 0x00000000UL;
	reg updateEventRegisterImage = 0x00000000UL;
	reg currentPrescalerRegisterImage = 0x00000000UL;
	reg stagedPrescalerRegisterImage = 0x00000000UL;
	reg currentAutoReloadRegisterImage = 0x00000000UL;
	reg stagedAutoReloadRegisterImage = 0x00000000UL;
	reg stagedCounterRegisterImage = 0x00000000UL;

	//! Validate the complete root request and require the application-owned clock gate.
	if (pConfig == NULL)
	{
		return DRIVER_STATUS_ERROR_NULL_PTR;
	}
	ASSERT_DRIVER_STATUS(_TIM_ValidateClockEnabled(TIMx));
	ASSERT_DRIVER_STATUS(_TIM_ValidateCounterConfig(&(pConfig->counter)));

	//! Snapshot CR1 once and validate its stopped state before reading the remaining root images.
	currentControlRegisterImage = LL_TIM_ReadCR1(TIMx);
	status = _TIM_ValidateCounterStoppedImage(currentControlRegisterImage);
	if (status == DRIVER_STATUS_SUCCESS)
	{
		//! Snapshot every remaining register required by the root transaction.
		currentPrescalerRegisterImage = LL_TIM_ReadPSC(TIMx);
		stagedPrescalerRegisterImage = currentPrescalerRegisterImage;
		currentAutoReloadRegisterImage = LL_TIM_ReadARR(TIMx);
		stagedAutoReloadRegisterImage = currentAutoReloadRegisterImage;
		stagedCounterRegisterImage = LL_TIM_ReadCNT(TIMx);

		//! Stage the complete counter domain into one final CR1 image.
		targetControlRegisterImage = currentControlRegisterImage;
		status = _TIM_StageCounterConfig(&(pConfig->counter), &targetControlRegisterImage);
	}
	if (status == DRIVER_STATUS_SUCCESS)
	{
		//! Stage only the register images represented by the root timebase structure.
		status = _TIM_StageTimeBaseConfig
		(
			&(pConfig->timebase),
			&stagedPrescalerRegisterImage,
			&stagedAutoReloadRegisterImage,
			&stagedCounterRegisterImage
		);
	}
	if (status == DRIVER_STATUS_SUCCESS)
	{
		//! Stage the mandatory update action from the final counter-control image.
		commitControlRegisterImage = targetControlRegisterImage;
		status = _TIM_StageTimeBaseUpdate(&commitControlRegisterImage, &updateEventRegisterImage);
	}

	if (status == DRIVER_STATUS_SUCCESS)
	{
		//! Dirty-write the root-owned preload registers before generating the staged update event.
		ASSERT_DRIVER_STATUS
		(
			_TIM_WritePSCIfChanged
			(
				TIMx,
				currentPrescalerRegisterImage,
				stagedPrescalerRegisterImage
			)
		);
		ASSERT_DRIVER_STATUS
		(
			_TIM_WriteARRIfChanged
			(
				TIMx,
				currentAutoReloadRegisterImage,
				stagedAutoReloadRegisterImage
			)
		);

		//! Apply the temporary update policy only when it differs from the cached CR1 image.
		ASSERT_DRIVER_STATUS
		(
			_TIM_WriteCR1IfChanged
			(
				TIMx,
				currentControlRegisterImage,
				commitControlRegisterImage
			)
		);
		//! Generate UG only after every cached configuration image has been committed.
		LL_TIM_WriteEGR(TIMx, updateEventRegisterImage);
		//! Restore the final requested CR1 image after the mandatory update action.
		ASSERT_DRIVER_STATUS
		(
			_TIM_WriteCR1IfChanged
			(
				TIMx,
				commitControlRegisterImage,
				targetControlRegisterImage
			)
		);
		//! UG resets CNT to its known default, so restore the staged initial count without rereading hardware.
		ASSERT_DRIVER_STATUS
		(
			_TIM_WriteCNTIfChanged
			(
				TIMx,
				(reg) TIMx_DEFAULT_CNT,
				stagedCounterRegisterImage
			)
		);
	}

