GodSpeeD-17/STM32F103C8T6_BareMetal/BareMetal/Driver/Timer/Src/timer.c
	return status;
}

// ==================================================================================================== //
//										Timer Group Configuration APIs									//
// ==================================================================================================== //

// -------------------------------- Timer TimeBase Configuration Pair --------------------------------- //

driver_status_t TIM_GetTimeBaseConfig(TIM_TypeDef* const TIMx, tim_config_timebase_t* const	pTimeBase)
{
	// Local Variables
	reg pscRegImage = 0x00000000UL;
	reg arrRegImage = 0x00000000UL;
	reg cntRegImage = 0x00000000UL;

	//! Validate the output pointer before any hardware access.
	if (pTimeBase == NULL)
	{
		return DRIVER_STATUS_ERROR_NULL_PTR;
	}

	ASSERT_DRIVER_STATUS(_TIM_ValidateClockEnabled(TIMx));

	//! Snapshot only the registers needed to extract the timebase group.
	pscRegImage = LL_TIM_ReadPSC(TIMx);
	arrRegImage = LL_TIM_ReadARR(TIMx);
	cntRegImage = LL_TIM_ReadCNT(TIMx);

	//! Decode the caller-owned register images into the public grouped structure.
	return Codec_TIM_ExtractTimeBaseConfig(pscRegImage, arrRegImage, cntRegImage, pTimeBase);
}

driver_status_t TIM_SetTimeBaseConfig(TIM_TypeDef* const TIMx, const tim_config_timebase_t* const pTimeBase)
{
	// Local Variables
	reg currentControlRegisterImage = 0x00000000UL;
	reg commitControlRegisterImage = 0x00000000UL;
	reg updateEventRegisterImage = 0x00000000UL;
	reg currentPrescalerRegisterImage = 0x00000000UL;
	reg stagedPrescalerRegisterImage = 0x00000000UL;
	reg currentAutoReloadRegisterImage = 0x00000000UL;
	reg stagedAutoReloadRegisterImage = 0x00000000UL;
	reg stagedCounterRegisterImage = 0x00000000UL;

	//! TimeBase scalars have no selector constraints, so only the user-supplied pointer is checked here.
	if (pTimeBase == NULL)
	{
		return DRIVER_STATUS_ERROR_NULL_PTR;
	}

	//! Own the narrow timebase transaction under an enabled clock.
	ASSERT_DRIVER_STATUS(_TIM_ValidateClockEnabled(TIMx));

	//! Snapshot CR1 once and reject a running counter before reading the remaining images.
	currentControlRegisterImage = LL_TIM_ReadCR1(TIMx);
	ASSERT_DRIVER_STATUS(_TIM_ValidateCounterStoppedImage(currentControlRegisterImage));

	//! Snapshot each remaining required register once before staging locally.
	commitControlRegisterImage = currentControlRegisterImage;
	currentPrescalerRegisterImage = LL_TIM_ReadPSC(TIMx);
	stagedPrescalerRegisterImage = currentPrescalerRegisterImage;
	currentAutoReloadRegisterImage = LL_TIM_ReadARR(TIMx);
	stagedAutoReloadRegisterImage = currentAutoReloadRegisterImage;
	stagedCounterRegisterImage = LL_TIM_ReadCNT(TIMx);

	ASSERT_DRIVER_STATUS
	(
		_TIM_StageTimeBaseConfig
		(
			pTimeBase,
			&stagedPrescalerRegisterImage,
			&stagedAutoReloadRegisterImage,
			&stagedCounterRegisterImage
		)
	);
	ASSERT_DRIVER_STATUS(_TIM_StageTimeBaseUpdate(&commitControlRegisterImage, &updateEventRegisterImage));

	//! Dirty-write both grouped preload registers before generating the staged update event.
	ASSERT_DRIVER_STATUS
	(
		_TIM_WritePSCIfChanged
		(
			TIMx,
			currentPrescalerRegisterImage,
			stagedPrescalerRegisterImage
		)
	);
	ASSERT_DRIVER_STATUS
	(
		_TIM_WriteARRIfChanged
		(
			TIMx,
			currentAutoReloadRegisterImage,
			stagedAutoReloadRegisterImage
		)
	);

	//! Apply the temporary update policy and generate UG only after every fallible step succeeds.
	ASSERT_DRIVER_STATUS
	(
		_TIM_WriteCR1IfChanged
		(
			TIMx,
			currentControlRegisterImage,
			commitControlRegisterImage
		)
	);
	LL_TIM_WriteEGR(TIMx, updateEventRegisterImage);
	//! Restore the caller's CR1 policy after the update action.
	ASSERT_DRIVER_STATUS
	(
		_TIM_WriteCR1IfChanged
		(
			TIMx,
			commitControlRegisterImage,
			currentControlRegisterImage
		)
	);
	//! UG resets CNT to its known default, so restore the staged initial count without rereading hardware.
	ASSERT_DRIVER_STATUS
	(
		_TIM_WriteCNTIfChanged
		(
			TIMx,
			(reg) TIMx_DEFAULT_CNT,
			stagedCounterRegisterImage
		)
	);

	return DRIVER_STATUS_SUCCESS;
}

// --------------------------------- Timer Counter Configuration Pair --------------------------------- //

driver_status_t TIM_GetCounterConfig(TIM_TypeDef* const TIMx, tim_config_counter_t* const pCounter)
{
	reg cr1RegImage = 0x00000000UL;

	//! Validate the output pointer before reading CR1.
	if (pCounter == NULL)
	{
		return DRIVER_STATUS_ERROR_NULL_PTR;
	}
	ASSERT_DRIVER_STATUS(_TIM_ValidateClockEnabled(TIMx));

	//! Counter configuration is fully represented by the current CR1 image.
	cr1RegImage = LL_TIM_ReadCR1(TIMx);
	//! Return the codec extraction status directly.
	return Codec_TIM_ExtractCounterConfig(cr1RegImage, pCounter);
}

driver_status_t TIM_SetCounterConfig(TIM_TypeDef* const TIMx, const tim_config_counter_t* const	pCounter)
{
	// Local Variables
	reg currentControlRegisterImage = 0x00000000UL;
	reg targetControlRegisterImage = 0x00000000UL;

	//! Validate the complete domain and own its narrow enabled-clock transaction.
	ASSERT_DRIVER_STATUS(_TIM_ValidateCounterConfig(pCounter));
	ASSERT_DRIVER_STATUS(_TIM_ValidateClockEnabled(TIMx));

	//! Snapshot CR1 once, reject a running counter, and stage one final target image.
	currentControlRegisterImage = LL_TIM_ReadCR1(TIMx);
	ASSERT_DRIVER_STATUS(_TIM_ValidateCounterStoppedImage(currentControlRegisterImage));
	targetControlRegisterImage = currentControlRegisterImage;
	ASSERT_DRIVER_STATUS(_TIM_StageCounterConfig(pCounter, &targetControlRegisterImage));

	return _TIM_WriteCR1IfChanged(TIMx, currentControlRegisterImage, targetControlRegisterImage);
}

// ==================================================================================================== //
//										Timer TimeBase Field APIs										//
// ==================================================================================================== //

driver_status_t TIM_GetInputClockFrequency(TIM_TypeDef* const TIMx, frequency_t* const pInputClockHz)
{
	// Local Variables
	rcc_bus_t	timerClockBus = RCC_APB1_BUS;
	frequency_t	timerInputClockHz = RCC_FREQ_ZERO;

	//! Validate destination storage before resolving or consulting the Timer clock bus.
	if (pInputClockHz == NULL)
	{
		return DRIVER_STATUS_ERROR_NULL_PTR;
	}
	ASSERT_DRIVER_STATUS(_TIM_DecodeRCCBus(TIMx, &timerClockBus));

	//! Derive the peripheral clock from the stable RCC bus-frequency snapshot selected by the instance mapping.
	timerInputClockHz = RCC_GetBusFrequency(timerClockBus);
	if (timerInputClockHz == RCC_FREQ_ZERO)
	{
		return DRIVER_STATUS_ERROR_STATE;
	}

	//! Apply the STM32F1 Timer-kernel x2 rule only when the mapped APB bus is prescaled.
	if (RCC_GetBusPrescaler(timerClockBus) != RCC_APB1_DIV_1)
	{
		timerInputClockHz <<= 1U;
	}

