GodSpeeD-17/STM32F103C8T6_BareMetal/BareMetal/Driver/Timer/Src/timer.c
	//! Publish only the fully derived result so caller storage remains unchanged on every failure path.
	*pInputClockHz = timerInputClockHz;
	return DRIVER_STATUS_SUCCESS;
}

driver_status_t TIM_GetProgrammedTickFrequency(TIM_TypeDef* const TIMx, frequency_t* const pFrequency)
{
	// Local Variables
	tim_prescaler_t prescaler = 0U;
	frequency_t timerInputClock = 0UL;

	//! Validate the output pointer before any derived-frequency calculation.
	if (pFrequency == NULL)
	{
		return DRIVER_STATUS_ERROR_NULL_PTR;
	}

	//! Reuse the public PSC getter so instance validation, clock-gate verification, and extraction stay centralized.
	ASSERT_DRIVER_STATUS(TIM_GetPrescaler(TIMx, &prescaler));
	ASSERT_DRIVER_STATUS(TIM_GetInputClockFrequency(TIMx, &timerInputClock));

	//! Hardware divides the Timer input clock by PSC + 1 to produce the counter tick frequency.
	*pFrequency = (frequency_t) (timerInputClock / (((frequency_t) prescaler) + 1UL));
	return DRIVER_STATUS_SUCCESS;
}

// --------------------------------------- Timer Prescaler Pair --------------------------------------- //

driver_status_t TIM_GetPrescaler(TIM_TypeDef* const TIMx, tim_prescaler_t* const pPrescaler)
{
	//! Validate the destination before touching the peripheral.
	if (pPrescaler == NULL)
	{
		return DRIVER_STATUS_ERROR_NULL_PTR;
	}

	ASSERT_DRIVER_STATUS(_TIM_ValidateClockEnabled(TIMx));

	//! PSC is a scalar register, so extraction only needs the current PSC image.
	return Codec_TIM_ExtractPrescaler(LL_TIM_ReadPSC(TIMx), pPrescaler);
}

driver_status_t TIM_SetPrescaler(TIM_TypeDef* const TIMx, const tim_prescaler_t	prescaler)
{
	// Local Variables
	reg currentControlRegisterImage = 0x00000000UL;
	reg commitControlRegisterImage = 0x00000000UL;
	reg updateEventRegisterImage = 0x00000000UL;
	reg currentPrescalerRegisterImage = 0x00000000UL;
	reg stagedPrescalerRegisterImage = 0x00000000UL;
	reg targetCounterRegisterImage = 0x00000000UL;

	//! Snapshot only the stopped-Timer images required to update and latch PSC.
	ASSERT_DRIVER_STATUS(_TIM_ValidateClockEnabled(TIMx));
	currentControlRegisterImage = LL_TIM_ReadCR1(TIMx);
	ASSERT_DRIVER_STATUS(_TIM_ValidateCounterStoppedImage(currentControlRegisterImage));
	commitControlRegisterImage = currentControlRegisterImage;
	currentPrescalerRegisterImage = LL_TIM_ReadPSC(TIMx);
	stagedPrescalerRegisterImage = currentPrescalerRegisterImage;
	targetCounterRegisterImage = LL_TIM_ReadCNT(TIMx);

	//! Stage the owned PSC field and the shared non-requesting update action before the first write.
	ASSERT_DRIVER_STATUS(Codec_TIM_StagePrescaler(&stagedPrescalerRegisterImage, prescaler));
	ASSERT_DRIVER_STATUS(_TIM_StageTimeBaseUpdate(&commitControlRegisterImage, &updateEventRegisterImage));

	//! Dirty-write only PSC, then latch it through the shared update-event commit sequence.
	ASSERT_DRIVER_STATUS
	(
		_TIM_WritePSCIfChanged
		(
			TIMx,
			currentPrescalerRegisterImage,
			stagedPrescalerRegisterImage
		)
	);

	//! Apply the temporary update policy and generate UG after the cached PSC write.
	ASSERT_DRIVER_STATUS
	(
		_TIM_WriteCR1IfChanged
		(
			TIMx,
			currentControlRegisterImage,
			commitControlRegisterImage
		)
	);
	LL_TIM_WriteEGR(TIMx, updateEventRegisterImage);
	//! Restore the original CR1 policy after the update action.
	ASSERT_DRIVER_STATUS
	(
		_TIM_WriteCR1IfChanged
		(
			TIMx,
			commitControlRegisterImage,
			currentControlRegisterImage
		)
	);
	//! UG resets CNT to its known default, so restore the cached value without rereading hardware.
	ASSERT_DRIVER_STATUS
	(
		_TIM_WriteCNTIfChanged
		(
			TIMx,
			(reg) TIMx_DEFAULT_CNT,
			targetCounterRegisterImage
		)
	);

	return DRIVER_STATUS_SUCCESS;
}

// -------------------------------------- Timer Auto-Reload Pair -------------------------------------- //

driver_status_t TIM_GetAutoReload(TIM_TypeDef* const TIMx, tim_auto_reload_t* const	pAutoReload)
{
	//! Validate the destination before touching the peripheral.
	if (pAutoReload == NULL)
	{
		return DRIVER_STATUS_ERROR_NULL_PTR;
	}

	ASSERT_DRIVER_STATUS(_TIM_ValidateClockEnabled(TIMx));

	//! ARR is a scalar register, so extraction only needs the current ARR image.
	return Codec_TIM_ExtractAutoReload(LL_TIM_ReadARR(TIMx), pAutoReload);
}

driver_status_t TIM_SetAutoReload(TIM_TypeDef* const TIMx, const tim_auto_reload_t autoReload)
{
	// Local Variables
	reg currentControlRegisterImage = 0x00000000UL;
	reg commitControlRegisterImage = 0x00000000UL;
	reg updateEventRegisterImage = 0x00000000UL;
	reg currentAutoReloadRegisterImage = 0x00000000UL;
	reg stagedAutoReloadRegisterImage = 0x00000000UL;
	reg targetCounterRegisterImage = 0x00000000UL;

	//! Snapshot only the stopped-Timer images required to update and latch ARR.
	ASSERT_DRIVER_STATUS(_TIM_ValidateClockEnabled(TIMx));
	currentControlRegisterImage = LL_TIM_ReadCR1(TIMx);
	ASSERT_DRIVER_STATUS(_TIM_ValidateCounterStoppedImage(currentControlRegisterImage));
	commitControlRegisterImage = currentControlRegisterImage;
	currentAutoReloadRegisterImage = LL_TIM_ReadARR(TIMx);
	stagedAutoReloadRegisterImage = currentAutoReloadRegisterImage;
	targetCounterRegisterImage = LL_TIM_ReadCNT(TIMx);

	//! Stage the owned ARR field and the shared non-requesting update action before the first write.
	ASSERT_DRIVER_STATUS(Codec_TIM_StageAutoReload(&stagedAutoReloadRegisterImage, autoReload));
	ASSERT_DRIVER_STATUS(_TIM_StageTimeBaseUpdate(&commitControlRegisterImage, &updateEventRegisterImage));

	//! Dirty-write only ARR, then latch it through the shared update-event commit sequence.
	ASSERT_DRIVER_STATUS
	(
		_TIM_WriteARRIfChanged
		(
			TIMx,
			currentAutoReloadRegisterImage,
			stagedAutoReloadRegisterImage
		)
	);

	//! Apply the temporary update policy and generate UG after the cached ARR write.
	ASSERT_DRIVER_STATUS
	(
		_TIM_WriteCR1IfChanged
		(
			TIMx,
			currentControlRegisterImage,
			commitControlRegisterImage
		)
	);
	LL_TIM_WriteEGR(TIMx, updateEventRegisterImage);
	//! Restore the original CR1 policy after the update action.
	ASSERT_DRIVER_STATUS
	(
		_TIM_WriteCR1IfChanged
		(
			TIMx,
			commitControlRegisterImage,
			currentControlRegisterImage
		)
	);
	//! UG resets CNT to its known default, so restore the cached value without rereading hardware.
	ASSERT_DRIVER_STATUS
	(
		_TIM_WriteCNTIfChanged
		(
			TIMx,
			(reg) TIMx_DEFAULT_CNT,
			targetCounterRegisterImage
		)
	);

	return DRIVER_STATUS_SUCCESS;
}

