GodSpeeD-17/STM32F103C8T6_BareMetal/BareMetal/Driver/Timer/Src/timer.c
	//! Read SR once and decode flags independently from DIER source state and NVIC delivery state.
	return Codec_TIM_ExtractIRQEvents(LL_TIM_ReadSR(TIMx), pIrqEvents);
}

driver_status_t TIM_AckIRQEvents(TIM_TypeDef* const TIMx, const tim_event_flag_t irqEvents)
{
	// Local Variable
	reg srAckRegImage = 0x00000000UL;

	//! Validate the ISR-owned instance without re-reading the initialization-owned RCC gate.
	ASSERT_DRIVER_STATUS(_TIM_ValidateInstance(TIMx));
	//! Stage and validate the complete W0C image without reading the live status register.
	ASSERT_DRIVER_STATUS(Codec_TIM_StageIRQEventAck(&srAckRegImage, irqEvents));
	//! Preserve unread input captures by checking channel mode only when a channel event was selected.
	ASSERT_DRIVER_STATUS(_TIM_ValidateIRQEventAckMode(TIMx, irqEvents));

	//! Write zeros only for selected flags and ones for every unselected W0C flag.
	LL_TIM_WriteSR(TIMx, srAckRegImage);
	return DRIVER_STATUS_SUCCESS;
}

// ==================================================================================================== //
//										Timer Blocking Delay APIs										//
// ==================================================================================================== //

// ---------------------------- Timer Blocking Delay Configuration Helper --------------------------- //

driver_status_t TIM_ConfigForBlockingDelay(TIM_TypeDef* const TIMx)
{
	// Local Variables
	driver_status_t status = DRIVER_STATUS_SUCCESS;
	frequency_t timerInputClock = RCC_FREQ_ZERO;
	reg currentControlRegisterImage = 0x00000000UL;
	reg targetControlRegisterImage = 0x00000000UL;
	const tim_config_t blockingDelayTimerConfig =
	{
		.timebase =
		{
			.prescaler = TIMx_DEFAULT_1MHz_PSC,
			.auto_reload = TIMx_DEFAULT_1MHz_ARR,
			.initial_count = TIMx_DEFAULT_CNT
		},
		.counter =
		{
			.digital_filter_clock_division = TIMx_DIGITAL_FILTER_CLOCK_DIV_1,
			.alignment = TIMx_MODE_NORMAL,
			.direction = TIMx_DIR_COUNT_UP,
			.one_pulse = TIMx_OPM_ENABLE,
			.auto_reload_preload = TIMx_ARPE_DISABLE,
			.update_source = TIMx_UPDATE_SOURCE_ANY
		}
	};

	//! Require the application-owned Timer gate before validating the fixed delay clock contract.
	ASSERT_DRIVER_STATUS(_TIM_ValidateClockEnabled(TIMx));
	//! Reject an incompatible clock tree before changing Timer register state.
	ASSERT_DRIVER_STATUS(TIM_GetInputClockFrequency(TIMx, &timerInputClock));
	if (timerInputClock != RCC_SYSCLK_MAX_FREQ)
	{
		return DRIVER_STATUS_ERROR_STATE;
	}

	//! Apply the stable timebase, OPM, and immediate-ARR policy for the blocking delay service.
	status = TIM_Config(TIMx, &blockingDelayTimerConfig);
	if (status != DRIVER_STATUS_SUCCESS)
	{
		return status;
	}

	//! Enable update events once so every allocated blocking delay can terminate on UIF.
	currentControlRegisterImage = LL_TIM_ReadCR1(TIMx);
	targetControlRegisterImage = currentControlRegisterImage;
	ASSERT_DRIVER_STATUS(Codec_TIM_StageUpdateEventState(&targetControlRegisterImage, DRIVER_STATUS_ON));
	ASSERT_DRIVER_STATUS
	(
		_TIM_WriteCR1IfChanged
		(
			TIMx,
			currentControlRegisterImage,
			targetControlRegisterImage
		)
	);

	//! Complete allocation with a stopped counter and no stale blocking-delay completion flag.
	return _TIM_ClearUpdateFlagIfPending(TIMx);
}

// ---------------------------------- Timer Microsecond Delay Helper ---------------------------------- //

driver_status_t TIM_BlockingDelayUs(TIM_TypeDef* const TIMx, const uint16_t delayUs)
{
	// Local Variables
	tim_auto_reload_t delayReload = 0U;
	driver_status_t pollStatus = DRIVER_STATUS_SUCCESS;
	driver_status_t cleanupStatus = DRIVER_STATUS_SUCCESS;
	uint32_t pollsRemaining = 0UL;
	reg currentControlRegisterImage = 0x00000000UL;
	reg currentAutoReloadRegisterImage = 0x00000000UL;
	reg currentCounterRegisterImage = 0x00000000UL;
	reg targetControlRegisterImage = 0x00000000UL;

	// Validate Input
	if (delayUs == 0U)
	{
		return DRIVER_STATUS_ERROR_INVALID_ARG;
	}
	//! Validate peripheral access; blocking-delay allocation remains an application-owned contract.
	ASSERT_DRIVER_STATUS(_TIM_ValidateClockEnabled(TIMx));

	delayReload = (tim_auto_reload_t) (delayUs - 1U);
	pollsRemaining = (((uint32_t) delayUs) * TIM_DRIVER_BLOCKING_DELAY_POLL_BUDGET_PER_US) + TIM_DRIVER_BLOCKING_DELAY_POLL_BUDGET_BASE;

	//! Program only changed blocking-delay interval and counter images, then clear stale completion state.
	currentAutoReloadRegisterImage = LL_TIM_ReadARR(TIMx);
	currentCounterRegisterImage = LL_TIM_ReadCNT(TIMx);
	ASSERT_DRIVER_STATUS(_TIM_WriteARRIfChanged(TIMx, currentAutoReloadRegisterImage, (reg) delayReload));
	ASSERT_DRIVER_STATUS(_TIM_WriteCNTIfChanged(TIMx, currentCounterRegisterImage, (reg) TIMx_DEFAULT_CNT));
	ASSERT_DRIVER_STATUS(_TIM_ClearUpdateFlagIfPending(TIMx));

	//! Start the preconfigured one-pulse blocking delay only after ARR, CNT, and UIF are ready.
	currentControlRegisterImage = LL_TIM_ReadCR1(TIMx);
	targetControlRegisterImage = currentControlRegisterImage;
	ASSERT_DRIVER_STATUS(Codec_TIM_StageCounterEnableState(&targetControlRegisterImage, DRIVER_STATUS_ON));
	ASSERT_DRIVER_STATUS(_TIM_WriteCR1IfChanged(TIMx, currentControlRegisterImage, targetControlRegisterImage));

	//! Poll within the bounded blocking budget; OPM stops the counter after successful completion.
	pollStatus = _TIM_PollBlockingDelayCompletion(TIMx, pollsRemaining);
	if (pollStatus == DRIVER_STATUS_SUCCESS)
	{
		//! Acknowledge the completion event without redundantly stopping an OPM-stopped counter.
		return _TIM_ClearUpdateFlagIfPending(TIMx);
	}

	//! An incomplete delay may still be counting, so abort it and clear any racing update event.
	cleanupStatus = _TIM_CleanupBlockingDelayState(TIMx);
	if (cleanupStatus != DRIVER_STATUS_SUCCESS)
	{
		return cleanupStatus;
	}

	return pollStatus;
}

// ---------------------------------- Timer Millisecond Delay Helper ---------------------------------- //

driver_status_t TIM_BlockingDelayMs(TIM_TypeDef* const TIMx, const uint32_t delayMs)
{
	// Local Variables
	volatile uint32_t elapsedMs = 0UL;

	//! Reject an empty request before the first composed Timer transaction.
	if (delayMs == 0UL)
	{
		return DRIVER_STATUS_ERROR_INVALID_ARG;
	}

	//! Compose the millisecond delay from bounded 1000-us primitive operations.
	for (elapsedMs = 0UL; elapsedMs < delayMs; elapsedMs++)
	{
		ASSERT_DRIVER_STATUS(TIM_BlockingDelayUs(TIMx, TIM_DRIVER_BLOCKING_DELAY_MS_CHUNK_US));
	}

	return DRIVER_STATUS_SUCCESS;
}
